{"title": "Power supply capacitor blown", "name": "t3_15pqp4n", "url": "https://www.reddit.com/r/techsupport/comments/15pqp4n/power_supply_capacitor_blown/", "selftext": "Woke up to my cat chewing on a box and thankfully I woke up when I did because shortly after, I heard a loud pop from my pc and started smelling the lovely smell of burnt electronics. I stripped it down as fast as possible and came to the conclusion that a psu capacitor was blown and leaking fluid all over the psu. I'm worried that it might have taken some other components of the pc along with it when It died. \n\nWhat are the black 420v caps used for and what are the chances that the rest of my pc is unaffected?", "score": 3, "upvote_ratio": 1.0, "permalink": "/r/techsupport/comments/15pqp4n/power_supply_capacitor_blown/", "id": "15pqp4n", "author": "Committee_Gloomy", "link_flair_text": "Open | Hardware", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1691905567.0, "comments": [{"author": "scalyblue", "id": "jvz3svt", "score": 3, "subreddit": "techsupport", "author_flair": null, "submission": "15pqp4n", "stickied": false, "body": "Generally speaking when a psu fails it tries really hard to fail in a manner that doesn’t overvolt the connected components.\n\nNo way to really find out short of probing all your voltage lines with a meter to see if they have shorts to ground, which is way more time consuming than popping in another psu", "is_submitter": false, "distinguished": null, "created_utc": 1691910501.0, "parent_id": "t3_15pqp4n", "replies": []}, {"author": "ElectronicInitial", "id": "jvz0cpq", "score": 2, "subreddit": "techsupport", "author_flair": null, "submission": "15pqp4n", "stickied": false, "body": "There really isn’t much that we can say about the other components being affected. Just get a new power supply and see if the components work. I would suggest going with as few components as possible to start, such as just cpu+mobo+ram, then if you have an old system that isn’t as valuable, maybe test the gpu and storage in there, that way if they have a short it doesn’t kill other components.", "is_submitter": false, "distinguished": null, "created_utc": 1691907950.0, "parent_id": "t3_15pqp4n", "replies": []}]}