{"title": "Why Is there this black band at the bottom of the screen?", "name": "t3_15pty8o", "url": "https://www.reddit.com/r/techsupport/comments/15pty8o/why_is_there_this_black_band_at_the_bottom_of_the/", "selftext": "Hi, i'm looking for an answer to my problem, please if you know It enlighten me 😂. \nIn my town there's a screen in a museum exhibit that, for the second time, shows a band on the bottom, like there are broken pixels(i don't know if it Is the correct name). The first time the screen showed a black band, that took the central bottom part of the screen, so It was replaced, but the new one, after a week or so, shows, in a similar position to the previous one, a rainbow band made of vertical lines. This screen is mounted at the height of the waist, so we thought that It could be caused by people leoning on It and pressing with their hands to watch the video from the top, could this be the answer? Or maybe Is the fact  that the support in which Is encased Is too tight and with heat this support Presses on the screen forming this band. Could it be a matter of Power surges, in my ignorance i think that a Power surge would have damged not only a minor part of the screen.\n\nIf you know the answer let me know, thanks in Advance.", "score": 2, "upvote_ratio": 1.0, "permalink": "/r/techsupport/comments/15pty8o/why_is_there_this_black_band_at_the_bottom_of_the/", "id": "15pty8o", "author": "Competitive_Ladder15", "link_flair_text": "Open | Hardware", "num_comments": 2, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1691917193.0, "comments": [{"author": "jamvanderloeff", "id": "jvzetwv", "score": 1, "subreddit": "techsupport", "author_flair": null, "submission": "15pty8o", "stickied": false, "body": "Can you get a photo of the issue? \n\nPhysical damage sure does sound possible there", "is_submitter": false, "distinguished": null, "created_utc": 1691919297.0, "parent_id": "t3_15pty8o", "replies": [{"author": "Competitive_Ladder15", "id": "jvzez9k", "score": 0, "subreddit": "techsupport", "author_flair": null, "submission": "15pty8o", "stickied": false, "body": "Yes, i already have It but i couldn't attach It to the post.", "is_submitter": true, "distinguished": null, "created_utc": 1691919416.0, "parent_id": "t1_jvzetwv", "replies": []}]}]}