{"title": "My sister just found out her Samsung phone has stalkerware/spyware on it, what should she do?", "name": "t3_15psior", "url": "https://www.reddit.com/r/techsupport/comments/15psior/my_sister_just_found_out_her_samsung_phone_has/", "selftext": "Heres some of the things that was happening to it:\n\n-The phone was being turned off on its own\n\n-The message on the lock screen that usually says to put your pin in had been changed, and now says something written by the person who put it on there\n\n-Find my Samsung was turned on, and even though we could hear the ringing, she couldn't turn off the location permission on the app (whenever she went into settings for the app,  it would constantly pop up a message, making it impossible to click anything)\n\n-The guy who did this (her ex) also said he had access to her messages\n\nSo she turned off WiFi and location, deleted a bunch of apps, shut down her phone, and changed the passwords on a bunch of her accounts. Now she's wondering what she should do next. Is there a way to fix this by ourselves, or do we have to go a store or something to get someone to remove it?", "score": 7, "upvote_ratio": 1.0, "permalink": "/r/techsupport/comments/15psior/my_sister_just_found_out_her_samsung_phone_has/", "id": "15psior", "author": "thesupremeburrito123", "link_flair_text": "Open | Phone", "num_comments": 4, "over_18": false, "spoiler": false, "pinned": false, "locked": false, "distinguished": null, "created_utc": 1691911908.0, "comments": [{"author": "NotDominusGhaul", "id": "jvz7309", "score": 6, "subreddit": "techsupport", "author_flair": null, "submission": "15psior", "stickied": false, "body": "Factory resetting the phone will normally be enough.\n\nYou've already done everything correct this far (changing passwords, disconnecting phone from internet etc.)", "is_submitter": false, "distinguished": null, "created_utc": 1691913048.0, "parent_id": "t3_15psior", "replies": []}, {"author": "Odobenous", "id": "jvz74wk", "score": 5, "subreddit": "techsupport", "author_flair": null, "submission": "15psior", "stickied": false, "body": "It seems like she's already taken the biggest step, which is to change the passwords for many of her accounts. If she did this from her phone, it might be prudent to do it again from a different device; the spyware could have watched her change those passwords, and by changing them on the infected phone, she could easily have just handed over access to any account that wasn't already compromised.\n\nAnother step to take is factory resetting the phone. Most Androids have this option in the settings menu, and procedures to do it without unlocking the phone can be found online if necessary. This will wipe all the data off the phone's internal drives, but particularly persistent malware may still survive elsewhere. I myself am not knowledgeable enough to know exactly where, so I'll pass that on to someone who knows more.", "is_submitter": false, "distinguished": null, "created_utc": 1691913089.0, "parent_id": "t3_15psior", "replies": []}, {"author": "8ballfpv", "id": "jvzc3jt", "score": 1, "subreddit": "techsupport", "author_flair": null, "submission": "15psior", "stickied": false, "body": "backup images etc to a pc first, boot into recovery and hard reset, this will make it \"out the box\" ready.  Sign up and use a new gmail account.", "is_submitter": false, "distinguished": null, "created_utc": 1691917066.0, "parent_id": "t3_15psior", "replies": []}, {"author": "yoti1988", "id": "jvzf5xa", "score": 1, "subreddit": "techsupport", "author_flair": null, "submission": "15psior", "stickied": false, "body": "Do a factory reset. Change all the passwords again. Make sure to have different passwords for each account. Turn on 2 Factor authentication. Report this incident to the police.", "is_submitter": false, "distinguished": null, "created_utc": 1691919570.0, "parent_id": "t3_15psior", "replies": []}]}